-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: minihotel
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `booking`
--

DROP TABLE IF EXISTS `booking`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `booking` (
  `booking_no` int NOT NULL AUTO_INCREMENT,
  `booking_date` date NOT NULL,
  `check_in` date NOT NULL,
  `check_out` date NOT NULL,
  `days` int NOT NULL,
  `customer_name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `customer_phone` varchar(45) CHARACTER SET utf8 DEFAULT NULL,
  `room_id` int DEFAULT NULL,
  `emp_name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `total_price` int NOT NULL,
  `booking_status_id` int DEFAULT NULL,
  PRIMARY KEY (`booking_no`),
  UNIQUE KEY `booking_no_UNIQUE` (`booking_no`),
  KEY `room_id_idx` (`room_id`),
  KEY `booking_status_id_idx` (`booking_status_id`),
  CONSTRAINT `booking_status_id` FOREIGN KEY (`booking_status_id`) REFERENCES `booking_status` (`booking_status_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `room_id` FOREIGN KEY (`room_id`) REFERENCES `room` (`room_id`) ON DELETE SET NULL ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb3 COLLATE=utf8_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `booking`
--

LOCK TABLES `booking` WRITE;
/*!40000 ALTER TABLE `booking` DISABLE KEYS */;
INSERT INTO `booking` VALUES (2,'2565-09-14','2565-09-15','2565-09-16',1,'ลิลิ','0897786566',1,'วิไลรา',3500,3),(3,'2565-09-14','2565-09-22','2565-09-24',2,'นิรา','0989987677',2,'วิไลรา',4000,3),(4,'2565-09-16','2565-09-28','2565-09-30',2,'วิมารา','0987787777',5,'วิไลรา',7000,3),(5,'2565-09-17','2565-10-02','2565-10-05',3,'lalisa','0987678888',1,'วิไลรา',10500,3),(6,'2565-09-17','2565-09-30','2565-10-05',5,'lasi','0998784534',6,'วิไลรา',10000,3),(7,'2565-09-17','2565-09-30','2565-10-05',5,'vili','0998984343',7,'วิไลรา',10000,3),(8,'2565-09-17','2565-10-03','2565-10-04',1,'waraporn','0942287888',9,'วิไลรา',3500,3),(9,'2565-09-17','2565-09-17','2565-09-21',4,'darika','0984458913',1,'วิไลรา',14000,3),(10,'2565-09-17','2565-10-17','2565-10-19',2,'eve','0987789663',5,'วิไลรา',7000,4),(11,'2565-09-29','2565-09-29','2565-09-30',1,'พิรา','0884568988',6,'ประภา',2562,3),(12,'2565-10-01','2565-10-01','2565-10-04',3,'ราวดี','0956789943',12,'ประภา',10770,3),(13,'2565-10-01','2565-10-19','2565-10-21',2,'สีวรา','0882345576',11,'ประภาพร',5534,4),(14,'2565-10-01','2565-10-28','2565-10-31',3,'ริรา','0989982231',9,'ประภาพร',10632,1),(15,'2565-10-01','2565-10-01','2565-10-02',1,'ลีลาวดี','0992872288',9,'ประภาพร',3544,3),(16,'2565-10-03','2565-10-03','2565-10-06',3,'วิมารา','0997653223',14,'ประภาพร',6297,3),(17,'2565-10-03','2565-10-20','2565-10-22',2,'พรพิมล','0998321177',13,'ประภาพร',6400,2),(18,'2565-10-03','2565-10-04','2565-10-06',2,'นารา','0995438898',16,'ประภาพร',7040,3),(19,'2565-10-03','2565-10-25','2565-10-27',2,'รพีพัน','032543876',11,'ประภาพร',5534,1),(20,'2565-10-03','2565-10-12','2565-10-14',2,'บีรพีร์','0984546677',6,'ประภาพร',5124,4),(21,'2565-10-03','2565-10-12','2565-10-14',2,'อรกมล','0889894455',13,'ประภาพร',6400,4),(22,'2565-10-03','2565-10-15','2565-10-17',2,'อรทัย','0987789232',6,'ประภาพร',5124,4),(23,'2565-10-03','2565-10-05','2565-10-07',2,'สุวิมารา','0982234544',6,'ประภาพร',5124,3),(24,'2565-10-03','2565-10-20','2565-10-21',1,'รีราวดี','0918739988',1,'ประภาพร',3500,3),(25,'2565-10-03','2565-10-14','2565-10-15',1,'ยารดี','0982234334',9,'ประภาพร',3544,4),(26,'2565-10-03','2565-10-07','2565-10-09',2,'สวีรสา','0976769988',5,'ประภาพร',7400,2),(27,'2565-10-03','2565-10-06','2565-10-07',1,'ศิลา','0889678890',5,'ประภาพร',3700,4),(28,'2565-10-03','2565-10-06','2565-10-08',2,'รินดา','0889321889',14,'ประภาพร',4198,4),(29,'2565-10-03','2565-10-06','2565-10-07',1,'พรกมล','0993438899',11,'ประภาพร',2767,3),(30,'2565-10-03','2565-10-14','2565-10-16',2,'ไกรพิณ','0954789899',14,'ประภาพร',4198,4),(31,'2565-10-04','2565-10-04','2565-10-08',4,'วราวดี','0968893233',9,'ประภาพร',14176,2),(32,'2565-10-04','2565-10-20','2565-10-27',7,'กาญวดี','0985547998',7,'ประภาพร',17969,2),(33,'2565-10-04','2565-10-20','2565-10-27',7,'วรัตนา','0983331989',16,'ประภาพร',24640,2),(34,'2565-10-04','2565-10-04','2565-10-06',2,'โสรนา','0983458897',5,'ประภาพร',7400,3),(35,'2565-10-04','2565-10-04','2565-10-06',2,'นราภา','0983338993',11,'วีนา',5534,3),(36,'2565-10-04','2565-10-04','2565-10-06',2,'ฟารีนา','0983347877',15,'ประภาพร',4178,3),(37,'2565-10-04','2565-10-04','2565-10-05',1,'พีรตา','0993458988',2,'ประภาพร',2000,3),(38,'2565-10-04','2565-10-14','2565-10-15',1,'โฟนิกา','0987765699',7,'ประภาพร',2567,4),(39,'2565-10-04','2565-10-12','2565-10-13',1,'โยวดี','0989234523',8,'ประภาพร',3502,4),(40,'2565-10-04','2565-10-30','2565-10-31',1,'ลดา','0928723787',12,'ประภาพร',3590,1),(41,'2565-10-04','2565-10-29','2565-10-31',2,'วีณา','0892328788',11,'ประภาพร',5534,1),(42,'2565-10-21','2565-10-21','2565-10-31',10,'ยุวรี','0983456678',1,'วีนา',35000,2),(43,'2565-10-21','2565-10-21','2565-10-31',10,'วารี','0985643344',8,'วีนา',35020,2),(44,'2565-10-21','2565-10-30','2565-10-31',1,'ไบรญา','0893456677',14,'ประภาพร',2099,1),(45,'2565-10-21','2565-10-27','2565-10-31',4,'ยารา','0928787332',15,'ประภาพร',8356,1);
/*!40000 ALTER TABLE `booking` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-21 15:44:53
